heavyC1oud/smilebrd/SW/src/Core/MCU/stm32l475_rcc_reg.h
/**
 * @file stm32l475_rcc_reg.h
 *
 *       Reset and clock control registers
 *
 *       Based on RM0051
 *       Reference manual STM32L4xxx
 *           advanced ARM-based 32-bit MCUs
 *           April 2020 Rev 7 www.st.com
 */

#ifndef STM32L475_RCC_REG_H
#define STM32L475_RCC_REG_H

#include "regs.h"
#include "stm32l4xx.h"

/**
 * @brief Clock control register (RCC_CR)
 *
 *        Address offset: 0x00
 *        Reset value: 0x0000 0063
 *        Access: no wait state, word, half-word and byte access
 */
MCU_REG_TYPE (
    rcc_cr_t,
    {
        mcu_reg_t msion          : 1; /*!< 0 MSION: MSI clock enable */
        mcu_reg_t msirdy         : 1; /*!< 1 MSIRDY: MSI clock ready flag */
        mcu_reg_t msipllen       : 1; /*!< 2 MSIPLLEN: MSI clock PLL enable */
        mcu_reg_t msirgsel       : 1; /*!< 3 MSIRGSEL: MSI clock range selection */
        mcu_reg_t msirange       : 4; /*!< 7:4 MSIRANGE[3:0] MSI clock ranges */
        mcu_reg_t hsion          : 1; /*!< 8 HSION: HSI16 clock enable */
        mcu_reg_t hsikeron       : 1; /*!< 9 HSIKERON: HSI16 always enable for peripheral kernels */
        mcu_reg_t hsirdy         : 1; /*!< 10 HSIRDY: HSI16 clock enable */
        mcu_reg_t hsiasfs        : 1; /*!< 11 HSIASFS: HSI16 automatic start from Stop */
        mcu_reg_t Reserved12_15  : 4; /*!< 15:12 Reserved, must be kept at reset value */
        mcu_reg_t hseon          : 1; /*!< 16 HSEON: HSE clock enable */
        mcu_reg_t hserdy         : 1; /*!< 17 HSERDY: HSE clock ready flag */
        mcu_reg_t hsebyp         : 1; /*!< 18 HSEBYP: HSE clock bypass */
        mcu_reg_t csson          : 1; /*!< 19 CSSON: Clock security system enable */
        mcu_reg_t Reserved20_23  : 4; /*!< 23:20 Reserved, must be kept at reset value */
        mcu_reg_t pllon          : 1; /*!< 24 PLLON: Main PLL enable */
        mcu_reg_t pllrdy         : 1; /*!< 25 PLLRDY: Main PLL clock ready flag */
        mcu_reg_t pllsai1on      : 1; /*!< 26 PLLSAI1ON: SAI1 PLL enable */
        mcu_reg_t pllsai1rdy     : 1; /*!< 27 PLLSAI1RDY: SAI1 PLL clock ready flag */
        mcu_reg_t pllsai2on      : 1; /*!< 28 PLLSAI2ON: SAI2 PLL enable */
        mcu_reg_t pllsai2rdy     : 1; /*!< 29 PLLSAI2RDY: SAI2 PLL clock ready flag */
        mcu_reg_t Reserved30_31  : 2; /*!< 31:30 Reserved, must be kept at reset value */
    }
);


/**
 * @brief Internal clock sources calibration register (RCC_ICSCR)
 *
 *        Address offset: 0x04
 *        Reset value: 0x10XX 00XX where X is factory-programmed
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_icsc_t,
    {
        mcu_reg_t msical         : 8; /*!< 7:0 MSICAL[7:0] MSI clock calibration */
        mcu_reg_t msitrim        : 8; /*!< 15:8 MSITRIM[7:0] MSI clock trimming */
        mcu_reg_t hsical         : 8; /*!< 23:16 HSICAL[7:0] HSI16 clock calibration */
        mcu_reg_t hsitrim        : 7; /*!< 24:30 HSITRIM[6:0] HSI16 clock trimming */
        mcu_reg_t Reserved31     : 1; /*!< 31 Reserved, must be kept at reset value */
    }
);


/**
 * @brief Clock configuration register (RCC_CFGR)
 *
 *        Address offset: 0x08
 *        Reset value: 0x0000 0000
 *        Access: 0 ≤ wait state ≤ 2, word, half-word and byte access
 *        1 or 2 wait states inserted only if the access occurs during a clock source switch.
 *        From 0 to 15 wait states inserted if the access occurs the APB or AHB prescalers values update is on going.
 */
MCU_REG_TYPE (
    rcc_cfg_t,
    {
        mcu_reg_t sw             : 2; /*!< 1:0 SW[1:0]: System clock switch */
        mcu_reg_t sws            : 2; /*!< 3:2 SWS[1:0]: System clock switch status */
        mcu_reg_t hpre           : 4; /*!< 7:4 HPRE[3:0]: AHB prescaler */
        mcu_reg_t ppre1          : 3; /*!< 10:8 PPRE1[2:0]: APB Low speed prescaler (APB1) */
        mcu_reg_t ppre2          : 3; /*!< 13:11 PPRE2[2:0]: APB high-speed prescaler (APB2) */
        mcu_reg_t Reserved14     : 1; /*!< 14 Reserved, must be kept at reset value */
        mcu_reg_t stopwuck       : 1; /*!< 15 STOPWUCK: Wakeup from Stop and CSS backup clock selection */
        mcu_reg_t Reserved16_23  : 8; /*!< 23:16 Reserved, must be kept at reset value */
        mcu_reg_t mcosel         : 4; /*!< 27:24 MCOSEL[3:0]: Microcontroller clock output */
        mcu_reg_t mcopre         : 3; /*!< 30:28 MCOPRE[2:0]: Microcontroller clock output prescaler */
        mcu_reg_t Reserved31     : 1; /*!< 31 Reserved, must be kept at reset value */
    }
);

/**
 * @brief PLL configuration register (RCC_PLLCFGR)
 *
 *        Address offset: 0x0C
 *        Reset value: 0x0000 1000
 *        Access: no wait state, word, half-word and byte access.
 *
 *        This register is used to configure the PLL clock outputs according
 *        to the formulas:
 *        * f(VCOclock) = f(PLL clock input) * (PLLN / PLLM)
 *        * f(PLL_P) = f(VCO clock) / PLLP
 *        * f(PLL_Q) = f(VCO clock) / PLLQ
 *        * f(PLL_R) = f(VCO clock) / PLLR
 */
MCU_REG_TYPE (
    rcc_pllcfg_t,
    {
        mcu_reg_t pllsrc         : 2; /*!< 1:0 PLLSRC[1:0]: Main PLL, PLLSAI1 and PLLSAI2 entry clock source */
        mcu_reg_t Reserved2_3    : 2; /*!< 3:2 Reserved, must be kept at reset value */
        mcu_reg_t pllm           : 3; /*!< 6:4 PLLM[2:0]: Division factor for the main PLL and audio PLL (PLLSAI1 and PLLSAI2) input clock */
        mcu_reg_t Reserved7      : 1; /*!< 7 Reserved, must be kept at reset value */
        mcu_reg_t plln           : 7; /*!< 14:8 PLLN[6:0]: Main PLL multiplication factor for VCO */
        mcu_reg_t Reserved15     : 1; /*!< 15 Reserved, must be kept at reset value */
        mcu_reg_t pllpen         : 1; /*!< 16 PLLPEN: Main PLL, PLLSAI3CLK output enable */
        mcu_reg_t pllp           : 1; /*!< 17 PLLP: Main PLL division factor for PLLSAI3CLK (SAI1 and SAI2 clock) */
        mcu_reg_t Reserved18_19  : 2; /*!< 19:18 Reserved, must be kept at reset value */
        mcu_reg_t pllqen         : 1; /*!< 20 PLLQEN: Main PLL PLL48M1CLK output enable */
        mcu_reg_t pllq           : 2; /*!< 22:21 PLLQ[1:0]: Main PLL division factor for PLL48M1CLK (48 MHz clock) */
        mcu_reg_t Reserved23     : 1; /*!< 23 Reserved, must be kept at reset value */
        mcu_reg_t pllren         : 1; /*!< 24 PLLREN: Main PLL PLLCLK output enable */
        mcu_reg_t pllr           : 2; /*!< 26:25 PLLR[1:0]: Main PLL division factor for PLLCLK (system clock) */
        mcu_reg_t pllpdiv        : 5; /*!< 31:27 PLLPDIV[4:0]: Main PLL division factor for PLLSAI2CLK */
    }
);

/**
 * @brief PLLSAI1 configuration register (RCC_PLLSAI1CFGR)
 *
 *        Address offset: 0x10
 *        Reset value: 0x0000 1000
 *        Access: 0 ≤ wait state ≤ 2, word, half-word and byte access
 *        1 or 2 wait states inserted only if the access occurs during a clock source switch.
 *        This register is used to configure the PLLSAI1 clock outputs according
 *        to the formulas:
 *        * f(VCOSAI1 clock) = f(PLL clock input) * (PLLSAI1N / PLLM)
 *        * f(PLLSAI1_P) = f(VCOSAI1 clock) / PLLSAI1P
 *        * f(PLLSAI1_Q) = f(VCOSAI1 clock) / PLLSAI1Q
 *        * f(PLLSAI1_R) = f(VCOSAI1 clock) / PLLSAI1R
 */
MCU_REG_TYPE (
    rcc_pllsai1cfg_t,
    {
        mcu_reg_t Reserved0_7    : 8; /*!< 7:0 Reserved, must be kept at reset value */
        mcu_reg_t pllsai1n       : 7; /*!< 14:8 PLLSAI1[6:0] multiplication factor for VCO */
        mcu_reg_t Reserved15     : 1; /*!< 15 Reserved, must be kept at reset value */
        mcu_reg_t pllsai1pen     : 1; /*!< 16 PLLSAI1PEN: PLLSAI1 PLLSAI1CLK output enable */
        mcu_reg_t pllsai1p       : 1; /*!< 17 PLLSAI1P: PLLSAI1 division factor for PLLSAI1CLK (SAI1 or SAI2 clock) */
        mcu_reg_t Reserved18_19  : 2; /*!< 19:18 Reserved, must be kept at reset value */
        mcu_reg_t pllsai1qen     : 1; /*!< 20 PLLSAI1QEN: PLLSAI1 PLL48M2CLK output enable */
        mcu_reg_t pllsai1q       : 2; /*!< 22:21 PLLSAI1Q[1:0] PLLSAI1 division factor for PLL48M2CLK (48 MHz clock) */
        mcu_reg_t Reserved23     : 1; /*!< 23 Reserved, must be kept at reset value */
        mcu_reg_t pllsai1ren     : 1; /*!< 24 PLLSAI1REN: PLLSAI1 PLLADC1CLK output enable */
        mcu_reg_t pllsai1r       : 2; /*!< 26:25 PLLSAI1R[1:0] PLLSAI1 division factor for PLLADC1CLK (ADC clock)*/
        mcu_reg_t pllsai1pdiv    : 5; /*!< 31:27 PLLSAI1PDIV[4:0] PLLSAI1 division factor for PLLSAI1CLK */
    }
);

/**
 * @brief PLLSAI2 configuration register (RCC_PLLSAI2CFGR)
 *
 *        Address offset: 0x14
 *        Reset value: 0x0000 1000
 *        Access: 0 ≤ wait state ≤ 2, word, half-word and byte access
 *        1 or 2 wait states inserted only if the access occurs during a clock source switch.
 *        This register is used to configure the PLLSAI2 clock outputs according
 *        to the formulas:
 *        * f(VCOSAI2 clock) = f(PLL clock input) * (PLLSAI2N / PLLM)
 *        * f(PLLSAI2_P) = f(VCOSAI2 clock) / PLLSAI2P
 *        * f(PLLSAI2_R) = f(VCOSAI2 clock) / PLLSAI2R
 */
MCU_REG_TYPE (
    rcc_pllsai2cfg_t,
    {
        mcu_reg_t Reserved0_7    : 8; /*!< 7:0 Reserved, must be kept at reset value */
        mcu_reg_t pllsai2n       : 7; /*!< 14:8 PLLSAI2[6:0] multiplication factor for VCO */
        mcu_reg_t Reserved15     : 1; /*!< 15 Reserved, must be kept at reset value */
        mcu_reg_t pllsai2pen     : 1; /*!< 16 PLLSAI2PEN: PLLSAI2 PLLSAI2CLK output enable */
        mcu_reg_t pllsai2p       : 1; /*!< 17 PLLSAI2P: PLLSAI2 division factor for PLLSAI2CLK (SAI1 or SAI2 clock) */
        mcu_reg_t Reserved18_23  : 6; /*!< 23:18 Reserved, must be kept at reset value */
        mcu_reg_t pllsai2ren     : 1; /*!< 24 PLLSAI2REN: PLLSAI2 PLLADC2CLK output enable */
        mcu_reg_t pllsai2r       : 2; /*!< 26:25 PLLSAI2R[1:0] PLLSAI2 division factor for PLLADC2CLK (ADC clock)*/
        mcu_reg_t pllsai2pdiv    : 5; /*!< 31:27 PLLSAI2PDIV[4:0] PLLSAI2 division factor for PLLSAI2CLK */
    }
);

/**
 * @brief Interrupt enable register (RCC_CIER)
 *
 *        Address offset: 0x18
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access
 */
MCU_REG_TYPE (
    rcc_cie_t,
    {
        mcu_reg_t lsirdyie       : 1; /*!< 0 LSIRDYIE: LSI ready interrupt enable */
        mcu_reg_t lserdyie       : 1; /*!< 1 LSERDYIE: LSE ready interrupt enable */
        mcu_reg_t msirdyie       : 1; /*!< 2 MSIRDYIE: MSI ready interrupt enable */
        mcu_reg_t hsirdyie       : 1; /*!< 3 HSIRDYIE: HSI16 ready interrupt enable */
        mcu_reg_t hserdyie       : 1; /*!< 4 HSERDYIE: HSE ready interrupt enable */
        mcu_reg_t pllrdyie       : 1; /*!< 5 PLLRDYIE: PLL ready interrupt enable */
        mcu_reg_t pllsai1rdyie   : 1; /*!< 6 PLLSAI1RDYIE: PLLSAI1 ready interrupt enable */
        mcu_reg_t pllsai2rdyie   : 1; /*!< 7 PLLSAI2RDYIE: PLLSAI2 ready interrupt enable */
        mcu_reg_t Reserved8      : 1; /*!< 8 Reserved, must be kept at reset value */
        mcu_reg_t lsecssie       : 1; /*!< 9 LSECSSIE: LSE clock security interrupt enable */
        mcu_reg_t hsi48rdyie     : 1; /*!< 10 HSI48RDYIE: HSI48 ready interrupt enable */
        mcu_reg_t Reserved11_31  : 21; /*!< 31:11 Reserved, must be kept at reset value */
    }
);

/**
 * @brief Clock interrupt flag register (RCC_CIFR)
 *
 *        Address offset: 0x1C
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access
 */
MCU_REG_TYPE (
    rcc_cif_t,
    {
        mcu_reg_t lsirdy         : 1; /*!< 0 LSIRDYF: LSI ready interrupt flag */
        mcu_reg_t lserdy         : 1; /*!< 1 LSERDYF: LSE ready interrupt flag */
        mcu_reg_t msirdy         : 1; /*!< 2 MSIRDYF: MSI ready interrupt flag */
        mcu_reg_t hsirdy         : 1; /*!< 3 HSIRDYF: HSI16 ready interrupt flag */
        mcu_reg_t hserdy         : 1; /*!< 4 HSERDYF: HSE ready interrupt flag */
        mcu_reg_t pllrdy         : 1; /*!< 5 PLLRDYF: PLL ready interrupt flag */
        mcu_reg_t pllsai1rdy     : 1; /*!< 6 PLLSAI1RDYF: PLLSAI1 ready interrupt flag */
        mcu_reg_t pllsai2rdy     : 1; /*!< 7 PLLSAI2RDYF: PLLSAI2 ready interrupt flag */
        mcu_reg_t css            : 1; /*!< 8 CSSF: Clock security system interrupt flag */
        mcu_reg_t lsecss         : 1; /*!< 9 LSECSSF: Clock security system interrupt flag */
        mcu_reg_t hsi48rdy       : 1; /*!< 10 HSI48RDYF: HSI48 ready interrupt flag */
        mcu_reg_t Reserved11_31  : 21; /*!< 31:11 Reserved, must be kept at reset value */
    }
);

/**
 * @brief Clock interrupt clear register (RCC_CICR)
 *
 *        Address offset: 0x20
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access
 */
MCU_REG_TYPE (
    rcc_cic_t,
    {
        mcu_reg_t lsirdyc        : 1; /*!< 0 LSIRDYC: LSI ready interrupt clear */
        mcu_reg_t lserdyc        : 1; /*!< 1 LSERDYC: LSE ready interrupt clear */
        mcu_reg_t msirdyc        : 1; /*!< 2 MSIRDYC: MSI ready interrupt clear */
        mcu_reg_t hsirdyc        : 1; /*!< 3 HSIRDYC: HSI16 ready interrupt clear */
        mcu_reg_t hserdyc        : 1; /*!< 4 HSERDYC: HSE ready interrupt clear */
        mcu_reg_t pllrdyc        : 1; /*!< 5 PLLRDYC: PLL ready interrupt clear */
        mcu_reg_t pllsai1rdyc    : 1; /*!< 6 PLLSAI1RDYC: PLLSAI1 ready interrupt clear */
        mcu_reg_t pllsai2rdyc    : 1; /*!< 7 PLLSAI2RDYC: PLLSAI2 ready interrupt clear */
        mcu_reg_t cssc           : 1; /*!< 8 CSSC: Clock security system interrupt clear */
        mcu_reg_t lsecssc        : 1; /*!< 9 LSECSSC: Clock security system interrupt clear */
        mcu_reg_t hsi48rdyc      : 1; /*!< 10 HSI48RDYC: HSI48 ready interrupt clear */
        mcu_reg_t Reserved11_31  : 21; /*!< 31:11 Reserved, must be kept at reset value */
    }
);

/**
 * @brief AHB1 peripheral reset register (RCC_AHB1RSTR)
 *
 *        Address offset: 0x28
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_ahb1rst_t,
    {
        mcu_reg_t dma1rst        : 1; /*!< 0 DMA1RST: DMA1 reset */
        mcu_reg_t dma2rst        : 1; /*!< 1 DMA2RST: DMA2 reset */
        mcu_reg_t Reserved2_7    : 6; /*!< 7:2 Reserved, must be kept at reset value */
        mcu_reg_t flashrst       : 1; /*!< 8 FLASHRST: Flash memory interface reset */
        mcu_reg_t Reserved9_11   : 3; /*!< 11:9 Reserved, must be kept at reset value */
        mcu_reg_t crcrst         : 1; /*!< 12 CRCRST: CRC reset */
        mcu_reg_t Reserved13_15  : 3; /*!< 15:13 Reserved, must be kept at reset value */
        mcu_reg_t tscrst         : 1; /*!< 16 TSCRST: Touch Sensing Controller reset */
        mcu_reg_t dma2drst       : 1; /*!< 17 DMA2DRST: DMA2D reset */
        mcu_reg_t Reserved18_31  : 14; /*!< 31:18 Reserved, must be kept at reset value */
    }
);

/**
 * @brief AHB2 peripheral reset register (RCC_AHB2RSTR)
 *
 *        Address offset: 0x2C
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_ahb2rst_t,
    {
        mcu_reg_t gpioarst       : 1; /*!< 0 GPIOARST: IO port A reset */
        mcu_reg_t gpiobrst       : 1; /*!< 1 GPIOBRST: IO port B reset */
        mcu_reg_t gpiocrst       : 1; /*!< 2 GPIOCRST: IO port C reset */
        mcu_reg_t gpiodrst       : 1; /*!< 3 GPIODRST: IO port D reset */
        mcu_reg_t gpioerst       : 1; /*!< 4 GPIOERST: IO port E reset */
        mcu_reg_t gpiofrst       : 1; /*!< 5 GPIOFRST: IO port F reset */
        mcu_reg_t gpiogrst       : 1; /*!< 6 GPIOGRST: IO port G reset */
        mcu_reg_t gpiohrst       : 1; /*!< 7 GPIOHRST: IO port H reset */
        mcu_reg_t gpioirst       : 1; /*!< 8 GPIOFRST: IO port I reset */
        mcu_reg_t Reserved9_11   : 3; /*!< 11:9 Reserved, must be kept at reset value */
        mcu_reg_t otgfsrst       : 1; /*!< 12 OTGFSRST: USB OTG FS reset */
        mcu_reg_t adcrst         : 1; /*!< 13 ADCRST: ADC reset */
        mcu_reg_t dcmirst        : 1; /*!< 14 DCMIRST: Digital Camera interface reset */
        mcu_reg_t Reserved15     : 1; /*!< 15 Reserved, must be kept at reset value */
        mcu_reg_t aesrst         : 1; /*!< 16 AESRST: AES hardware accelerator reset */
        mcu_reg_t hashrst        : 1; /*!< 17 HASHRST: HASH reset */
        mcu_reg_t rngrst         : 1; /*!< 18 RNGRST: Random number generator reset */
        mcu_reg_t Reserved19_31  : 13; /*!< 31:19 Reserved, must be kept at reset value */
    }
);

/**
 * @brief AHB3 peripheral reset register (RCC_AHB3RSTR)
 *
 *        Address offset: 0x30
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_ahb3rst_t,
    {
        mcu_reg_t fmcrst         : 1; /*!< 0 FMCRST: Flexible memory controller reset */
        mcu_reg_t Reserved1_7    : 7; /*!< 7:1 Reserved, must be kept at reset value */
        mcu_reg_t qspirst        : 1; /*!< 8 QSPIRST: QUADSPI1 memory interface reset */
        mcu_reg_t Reserved9_31   : 23; /*!< 31:9 Reserved, must be kept at reset value */
    }
);

/**
 * @brief APB1 peripheral reset register 1 (RCC_APB1RSTR1)
 *
 *        Address offset: 0x38
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_apb1rst1_t,
    {
        mcu_reg_t tim2rst        : 1; /*!< 0 TIM2RST: TIM2 timer reset */
        mcu_reg_t tim3rst        : 1; /*!< 1 TIM3RST: TIM3 timer reset */
        mcu_reg_t tim4rst        : 1; /*!< 2 TIM4RST: TIM4 timer reset */
        mcu_reg_t tim5rst        : 1; /*!< 3 TIM5RST: TIM5 timer reset */
        mcu_reg_t tim6rst        : 1; /*!< 4 TIM6RST: TIM6 timer reset */
        mcu_reg_t tim7rst        : 1; /*!< 5 TIM7RST: TIM7 timer reset */
        mcu_reg_t Reserved6_8    : 3; /*!< 8:6 Reserved, must be kept at reset value */
        mcu_reg_t lcdrst         : 1; /*!< 9 LCDRST: LCD interface reset */
        mcu_reg_t Reserved10_13  : 4; /*!< 13:10 Reserved, must be kept at reset value */
        mcu_reg_t spi2rst        : 1; /*!< 14 SPI2RST: SPI 2 reset */
        mcu_reg_t spi3rst        : 1; /*!< 15 SPI3RST: SPI 3 reset */
        mcu_reg_t Reserved16     : 1; /*!< 16 Reserved, must be kept at reset value */
        mcu_reg_t usart2rst      : 1; /*!< 17 USART2RST: USART 2 reset */
        mcu_reg_t usart3rst      : 1; /*!< 18 USART3RST: USART 3 reset */
        mcu_reg_t usart4rst      : 1; /*!< 19 USART4RST: USART 4 reset */
        mcu_reg_t usart5rst      : 1; /*!< 20 USART5RST: USART 5 reset */
        mcu_reg_t i2c1rst        : 1; /*!< 21 I2C1RST: I2C 1 reset */
        mcu_reg_t i2c2rst        : 1; /*!< 22 I2C2RST: I2C 2 reset */
        mcu_reg_t i2c3rst        : 1; /*!< 23 I2C3RST: I2C 3 reset */
        mcu_reg_t crsrst         : 1; /*!< 24 CRSRST: CRS reset */
        mcu_reg_t can1rst        : 1; /*!< 25 CAN1RST: CAN1 reset */
        mcu_reg_t can2rst        : 1; /*!< 26 CAN2RST: CAN2 reset */
        mcu_reg_t Reserved27     : 1; /*!< 27 Reserved, must be kept at reset value */
        mcu_reg_t pwrrst         : 1; /*!< 28 PWRRST: Power interface reset */
        mcu_reg_t dac1rst        : 1; /*!< 29 DAC1RST: DAC1 interface reset */
        mcu_reg_t opamprst       : 1; /*!< 30 OPAMPRST: OPAMP interface reset */
        mcu_reg_t lptim1rst      : 1; /*!< 31 LPTIM1RST: Low Power Timer 1 reset */
    }
);

/**
 * @brief APB1 peripheral reset register 2 (RCC_APB1RSTR2)
 *
 *        Address offset: 0x3C
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_apb1rst2_t,
    {
        mcu_reg_t lpuart1rst     : 1; /*!< 0 LPUART1RST: Low-power UART 1 reset */
        mcu_reg_t i2c4rst        : 1; /*!< 1 I2C4RST: I2C 4 reset */
        mcu_reg_t swpmi1rst      : 1; /*!< 2 SWPMI1RST: Single wire protocol reset */
        mcu_reg_t Reserved3_4    : 2; /*!< 4:3 Reserved, must be kept at reset value */
        mcu_reg_t lptim2rst      : 1; /*!< 5 LPTIM2RST: Low Power Timer 2 reset */
        mcu_reg_t Reserved6_31   : 26; /*!< 31:6 Reserved, must be kept at reset value */
    }
);

/**
 * @brief APB2 peripheral reset register (RCC_APB2RSTR)
 *
 *        Address offset: 0x40
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_apb2rst_t,
    {
        mcu_reg_t syscfgrst      : 1; /*!< 0 SYSCFGRST: SYSCFG + COMP + VREFBUF reset */
        mcu_reg_t Reserved1_9    : 9; /*!< 9:1 Reserved, must be kept at reset value */
        mcu_reg_t sdmmc1rst      : 1; /*!< 10 SDMMC1RST: SDMMC reset */
        mcu_reg_t tim1rst        : 1; /*!< 11 TIM1RST: TIM1 timer reset */
        mcu_reg_t spi1rst        : 1; /*!< 12 SPI1RST: SPI 1 reset */
        mcu_reg_t tim8rst        : 1; /*!< 13 TIM8RST: TIM8 timer reset */
        mcu_reg_t usart1rst      : 1; /*!< 14 USART1RST: USART 1 reset */
        mcu_reg_t Reserved15     : 1; /*!< 15 Reserved, must be kept at reset value */
        mcu_reg_t tim15rst       : 1; /*!< 16 TIM15RST: TIM15 timer reset */
        mcu_reg_t tim16rst       : 1; /*!< 17 TIM16RST: TIM16 timer reset */
        mcu_reg_t tim17rst       : 1; /*!< 18 TIM17RST: TIM17 timer reset */
        mcu_reg_t Reserved19_20  : 2; /*!< 20:19 Reserved, must be kept at reset value */
        mcu_reg_t sai1rst        : 1; /*!< 21 SAI1RST: Serial audio interface 1 (SAI1) reset */
        mcu_reg_t sai2rst        : 1; /*!< 22 SAI2RST: Serial audio interface 2 (SAI2) reset */
        mcu_reg_t Reserved23     : 1; /*!< 23 Reserved, must be kept at reset value */
        mcu_reg_t dfsdm1rst      : 1; /*!< 24 DFSDM1RST: Digital filters for sigma-delta modulators (DFSDM1) reset */
        mcu_reg_t Reserved25_31  : 7; /*!< 31:25 Reserved, must be kept at reset value */
    }
);

/**
 * @brief AHB1 peripheral clock enable register (RCC_AHB1ENR)
 *
 *        Address offset: 0x48
 *        Reset value: 0x0000 0100
 *        Access: no wait state, word, half-word and byte access.
 *        When the peripheral clock in not active, the peripheral registers read or write access is not supprted.
 */
MCU_REG_TYPE (
    rcc_ahb1en_t,
    {
        mcu_reg_t dma1en         : 1; /*!< 0 DMA1EN: DMA1 clock enable */
        mcu_reg_t dma2en         : 1; /*!< 1 DMA2EN: DMA2 clock enable */
        mcu_reg_t Reserved2_7    : 6; /*!< 7:2 Reserved, must be kept at reset value */
        mcu_reg_t flashen        : 1; /*!< 8 FLASHEN: Flash memory interface clock enable */
        mcu_reg_t Reserved9_11   : 3; /*!< 11:9 Reserved, must be kept at reset value */
        mcu_reg_t crcen          : 1; /*!< 12 CRCEN: CRC clock enable */
        mcu_reg_t Reserved13_15  : 3; /*!< 15:13 Reserved, must be kept at reset value */
        mcu_reg_t tscen          : 1; /*!< 16 TSCEN: Touch Sensing Controller clock enable */
        mcu_reg_t dma2den        : 1; /*!< 17 DMA2DEN: DMA2D clock enable */
        mcu_reg_t Reserved18_31  : 14; /*!< 31:18 Reserved, must be kept at reset value */
    }
);

