heavyC1oud/smilebrd/SW/src/Core/MCU/stm32l475_rcc_reg.h
/**
 * @brief AHB2 peripheral clock enable register (RCC_AHB2ENR)
 *
 *        Address offset: 0x4C
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 *        When the peripheral clock in not active, the peripheral registers read or write access is not supprted.
 */
MCU_REG_TYPE (
    rcc_ahb2en_t,
    {
        mcu_reg_t gpioaen        : 1; /*!< 0 GPIOAEN: IO port A clock enable */
        mcu_reg_t gpioben        : 1; /*!< 1 GPIOBEN: IO port B clock enable */
        mcu_reg_t gpiocen        : 1; /*!< 2 GPIOCEN: IO port C clock enable */
        mcu_reg_t gpioden        : 1; /*!< 3 GPIODEN: IO port D clock enable */
        mcu_reg_t gpioeen        : 1; /*!< 4 GPIOEEN: IO port E clock enable */
        mcu_reg_t gpiofen        : 1; /*!< 5 GPIOFEN: IO port F clock enable */
        mcu_reg_t gpiogen        : 1; /*!< 6 GPIOGEN: IO port G clock enable */
        mcu_reg_t gpiohen        : 1; /*!< 7 GPIOHEN: IO port H clock enable */
        mcu_reg_t gpioien        : 1; /*!< 8 GPIOFEN: IO port I clock enable */
        mcu_reg_t Reserved9_11   : 3; /*!< 11:9 Reserved, must be kept at reset value */
        mcu_reg_t otgfsen        : 1; /*!< 12 OTGFSEN: USB OTG FS clock enable */
        mcu_reg_t adcen          : 1; /*!< 13 ADCEN: ADC clock enable */
        mcu_reg_t dcmien         : 1; /*!< 14 DCMIEN: Digital Camera interface clock enable */
        mcu_reg_t Reserved15     : 1; /*!< 15 Reserved, must be kept at reset value */
        mcu_reg_t aesen          : 1; /*!< 16 AESEN: AES hardware accelerator clock enable */
        mcu_reg_t hashen         : 1; /*!< 17 HASHEN: HASH clock enable */
        mcu_reg_t rngen          : 1; /*!< 18 RNGEN: Random number generator clock enable */
        mcu_reg_t Reserved19_31  : 13; /*!< 31:19 Reserved, must be kept at reset value */
    }
);

/**
 * @brief AHB3 peripheral clock enable register (RCC_AHB3ENR)
 *
 *        Address offset: 0x50
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 *        When the peripheral clock in not active, the peripheral registers read or write access is not supprted.
 */
MCU_REG_TYPE (
    rcc_ahb3en_t,
    {
        mcu_reg_t fmcen          : 1; /*!< 0 FMCEN: Flexible memory controller clock enable */
        mcu_reg_t Reserved1_7    : 7; /*!< 7:1 Reserved, must be kept at reset value */
        mcu_reg_t qspien         : 1; /*!< 8 QSPIEN: QUADSPI1 memory interface clock enable */
        mcu_reg_t Reserved9_31   : 23; /*!< 31:9 Reserved, must be kept at reset value */
    }
);

/**
 * @brief APB1 peripheral clock enable register 1 (RCC_APB1ENR1)
 *
 *        Address offset: 0x58
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 *        When the peripheral clock in not active, the peripheral registers read or write access is not supprted.
 */
MCU_REG_TYPE (
    rcc_apb1en1_t,
    {
        mcu_reg_t tim2en         : 1; /*!< 0 TIM2EN: TIM2 timer clock enable */
        mcu_reg_t tim3en         : 1; /*!< 1 TIM3EN: TIM3 timer clock enable */
        mcu_reg_t tim4en         : 1; /*!< 2 TIM4EN: TIM4 timer clock enable */
        mcu_reg_t tim5en         : 1; /*!< 3 TIM5EN: TIM5 timer clock enable */
        mcu_reg_t tim6en         : 1; /*!< 4 TIM6EN: TIM6 timer clock enable */
        mcu_reg_t tim7en         : 1; /*!< 5 TIM7EN: TIM7 timer clock enable */
        mcu_reg_t Reserved6_8    : 3; /*!< 8:6 Reserved, must be kept at reset value */
        mcu_reg_t lcden          : 1; /*!< 9 LCDEN: LCD interface clock enable */
        mcu_reg_t rtcapben       : 1; /*!< 10 RTCAPBEN: RTC APB clock enable */
        mcu_reg_t wwdgen         : 1; /*!< 11 WWDGEN: Window watchdog clock enable */
        mcu_reg_t Reserved12_13  : 2; /*!< 13:12 Reserved, must be kept at reset value */
        mcu_reg_t spi2en         : 1; /*!< 14 SPI2EN: SPI 2 clock enable */
        mcu_reg_t spi3en         : 1; /*!< 15 SPI3EN: SPI 3 clock enable */
        mcu_reg_t Reserved16     : 1; /*!< 16 Reserved, must be kept at reset value */
        mcu_reg_t usart2en       : 1; /*!< 17 USART2EN: USART 2 clock enable */
        mcu_reg_t usart3en       : 1; /*!< 18 USART3EN: USART 3 clock enable */
        mcu_reg_t usart4en       : 1; /*!< 19 USART4EN: USART 4 clock enable */
        mcu_reg_t usart5en       : 1; /*!< 20 USART5EN: USART 5 clock enable */
        mcu_reg_t i2c1en         : 1; /*!< 21 I2C1EN: I2C 1 clock enable */
        mcu_reg_t i2c2en         : 1; /*!< 22 I2C2EN: I2C 2 clock enable */
        mcu_reg_t i2c3en         : 1; /*!< 23 I2C3EN: I2C 3 clock enable */
        mcu_reg_t crsen          : 1; /*!< 24 CRSEN: CRS clock enable */
        mcu_reg_t can1en         : 1; /*!< 25 CAN1EN: CAN1 clock enable */
        mcu_reg_t can2en         : 1; /*!< 26 CAN2EN: CAN2 clock enable */
        mcu_reg_t Reserved27     : 1; /*!< 27 Reserved, must be kept at reset value */
        mcu_reg_t pwren          : 1; /*!< 28 PWREN: Power interface clock enable */
        mcu_reg_t dac1en         : 1; /*!< 29 DAC1EN: DAC1 interface clock enable */
        mcu_reg_t opampen        : 1; /*!< 30 OPAMPEN: OPAMP interface clock enable */
        mcu_reg_t lptim1en       : 1; /*!< 31 LPTIM1EN: Low Power Timer 1 clock enable */
    }
);

/**
 * @brief APB1 peripheral clock enable register 2 (RCC_APB1ENR2)
 *
 *        Address offset: 0x5C
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 *        When the peripheral clock in not active, the peripheral registers read or write access is not supprted.
 */
MCU_REG_TYPE (
    rcc_apb1en2_t,
    {
        mcu_reg_t lpuart1en      : 1; /*!< 0 LPUART1EN: Low-power UART 1 clock enable */
        mcu_reg_t i2c4en         : 1; /*!< 1 I2C4EN: I2C 4 clock enable */
        mcu_reg_t swpmi1en       : 1; /*!< 2 SWPMI1EN: Single wire protocol clock enable */
        mcu_reg_t Reserved3_4    : 2; /*!< 4:3 Reserved, must be kept at reset value */
        mcu_reg_t lptim2en       : 1; /*!< 5 LPTIM2EN: Low Power Timer 2 clock enable */
        mcu_reg_t Reserved6_31   : 26; /*!< 31:6 Reserved, must be kept at reset value */
    }
);

/**
 * @brief APB2 peripheral clock enable register (RCC_APB2ENR)
 *
 *        Address offset: 0x60
 *        Reset value: 0x0000 0000
 *        Access: no wait state, word, half-word and byte access.
 *        When the peripheral clock in not active, the peripheral registers read or write access is not supprted.
 */
MCU_REG_TYPE (
    rcc_apb2en_t,
    {
        mcu_reg_t syscfgen       : 1; /*!< 0 SYSCFGEN: SYSCFG + COMP + VREFBUF clock enable */
        mcu_reg_t Reserved1_6    : 6; /*!< 6:1 Reserved, must be kept at reset value */
        mcu_reg_t fwen           : 1; /*!< 7 FWEN: Firewall clock enable */
        mcu_reg_t Reserved8_9    : 2; /*!< 9:8 Reserved, must be kept at reset value */
        mcu_reg_t sdmmc1en       : 1; /*!< 10 SDMMC1EN: SDMMC clock enable */
        mcu_reg_t tim1en         : 1; /*!< 11 TIM1EN: TIM1 timer clock enable */
        mcu_reg_t spi1en         : 1; /*!< 12 SPI1EN: SPI 1 clock enable */
        mcu_reg_t tim8en         : 1; /*!< 13 TIM8EN: TIM8 timer clock enable */
        mcu_reg_t usart1en       : 1; /*!< 14 USART1EN: USART 1 clock enable */
        mcu_reg_t Reserved15     : 1; /*!< 15 Reserved, must be kept at reset value */
        mcu_reg_t tim15en        : 1; /*!< 16 TIM15EN: TIM15 timer clock enable */
        mcu_reg_t tim16en        : 1; /*!< 17 TIM16EN: TIM16 timer clock enable */
        mcu_reg_t tim17en        : 1; /*!< 18 TIM17EN: TIM17 timer clock enable */
        mcu_reg_t Reserved19_20  : 2; /*!< 20:19 Reserved, must be kept at reset value */
        mcu_reg_t sai1en         : 1; /*!< 21 SAI1EN: Serial audio interface 1 (SAI1) clock enable */
        mcu_reg_t sai2en         : 1; /*!< 22 SAI2EN: Serial audio interface 2 (SAI2) clock enable */
        mcu_reg_t Reserved23     : 1; /*!< 23 Reserved, must be kept at reset value */
        mcu_reg_t dfsdm1en       : 1; /*!< 24 DFSDM1EN: Digital filters for sigma-delta modulators (DFSDM1) clock enable */
        mcu_reg_t Reserved25_31  : 7; /*!< 31:25 Reserved, must be kept at reset value */
    }
);

/**
 * @brief AHB1 peripheral clock enable in Sleep and Stop modes register (RCC_AHB1SMENR)
 *
 *        Address offset: 0x68
 *        Reset value: 0x0001 1303
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_ahb1smen_t,
    {
        mcu_reg_t dma1smen       : 1; /*!< 0 DMA1SMEN: DMA1 clock enable in Sleep and Stop modes */
        mcu_reg_t dma2smen       : 1; /*!< 1 DMA2SMEN: DMA2 clock enable in Sleep and Stop modes */
        mcu_reg_t Reserved2_7    : 6; /*!< 7:2 Reserved, must be kept at reset value */
        mcu_reg_t flashsmen      : 1; /*!< 8 FLASHSMEN: Flash memory interface clock enable in Sleep and Stop modes */
        mcu_reg_t sram1smen      : 1; /*!< 9 SRAM1SMEN: SRAM1 interface clock enable in Sleep and Stop modes */
        mcu_reg_t Reserved10_11  : 2; /*!< 11:9 Reserved, must be kept at reset value */
        mcu_reg_t crcsmen        : 1; /*!< 12 CRCSMEN: CRC clock enable in Sleep and Stop modes */
        mcu_reg_t Reserved13_15  : 3; /*!< 15:13 Reserved, must be kept at reset value */
        mcu_reg_t tscsmen        : 1; /*!< 16 TSCSMEN: Touch Sensing Controller clock enable in Sleep and Stop modes */
        mcu_reg_t dma2dsmen      : 1; /*!< 17 DMA2DSMEN: DMA2D clock enable in Sleep and Stop modes */
        mcu_reg_t Reserved18_31  : 14; /*!< 31:18 Reserved, must be kept at reset value */
    }
);

/**
 * @brief AHB2 peripheral clock enable in Sleep and Stop modes register (RCC_AHB2SMENR)
 *
 *        Address offset: 0x6C
 *        Reset value: 0x0005 32FF
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_ahb2smen_t,
    {
        mcu_reg_t gpioasmen      : 1; /*!< 0 GPIOASMEN: IO port A clock enable during Sleep and Stop modes */
        mcu_reg_t gpiobsmen      : 1; /*!< 1 GPIOBSMEN: IO port B clock enable during Sleep and Stop modes */
        mcu_reg_t gpiocsmen      : 1; /*!< 2 GPIOCSMEN: IO port C clock enable during Sleep and Stop modes */
        mcu_reg_t gpiodsmen      : 1; /*!< 3 GPIODSMEN: IO port D clock enable during Sleep and Stop modes */
        mcu_reg_t gpioesmen      : 1; /*!< 4 GPIOESMEN: IO port E clock enable during Sleep and Stop modes */
        mcu_reg_t gpiofsmen      : 1; /*!< 5 GPIOFSMEN: IO port F clock enable during Sleep and Stop modes */
        mcu_reg_t gpiogsmen      : 1; /*!< 6 GPIOGSMEN: IO port G clock enable during Sleep and Stop modes */
        mcu_reg_t gpiohsmen      : 1; /*!< 7 GPIOHSMEN: IO port H clock enable during Sleep and Stop modes */
        mcu_reg_t gpioismen      : 1; /*!< 8 GPIOFSMEN: IO port I clock enable during Sleep and Stop modes */
        mcu_reg_t sram2smen      : 1; /*!< 9 SRAM2SMEN: SRAM2 interface clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved10_11  : 2; /*!< 11:10 Reserved, must be kept at reset value */
        mcu_reg_t otgfssmen      : 1; /*!< 12 OTGFSSMEN: USB OTG FS clock enable during Sleep and Stop modes */
        mcu_reg_t adcsmen        : 1; /*!< 13 ADCSMEN: ADC clock enable during Sleep and Stop modes */
        mcu_reg_t dcmismen       : 1; /*!< 14 DCMISMEN: Digital Camera interface clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved15     : 1; /*!< 15 Reserved, must be kept at reset value */
        mcu_reg_t aessmen        : 1; /*!< 16 AESSMEN: AES hardware accelerator clock enable during Sleep and Stop modes */
        mcu_reg_t hashsmen       : 1; /*!< 17 HASHSMEN: HASH clock enable during Sleep and Stop modes */
        mcu_reg_t rngsmen        : 1; /*!< 18 RNGSMEN: Random number gsmenerator clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved19_31  : 13; /*!< 31:19 Reserved, must be kept at reset value */
    }
);

/**
 * @brief AHB3 peripheral clock enable in Sleep and Stop modes register (RCC_AHB3SMENR)
 *
 *        Address offset: 0x70
 *        Reset value: 0x0000 0101
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_ahb3smen_t,
    {
        mcu_reg_t fmcsmen        : 1; /*!< 0 FMCSMEN: Flexible memory controller clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved1_7    : 7; /*!< 7:1 Reserved, must be kept at reset value */
        mcu_reg_t qspismen       : 1; /*!< 8 QSPISMEN: QUADSPI1 memory interface clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved9_31   : 23; /*!< 31:9 Reserved, must be kept at reset value */
    }
);

/**
 * @brief APB1 peripheral clock enable in Sleep and Stop modes register 1 (RCC_APB1SMENR1)
 *
 *        Address offset: 0x78
 *        Reset value: 0xF2FE CA3F
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_apb1smen1_t,
    {
        mcu_reg_t tim2smen       : 1; /*!< 0 TIM2SMEN: TIM2 timer clock enable during Sleep and Stop modes */
        mcu_reg_t tim3smen       : 1; /*!< 1 TIM3SMEN: TIM3 timer clock enable during Sleep and Stop modes */
        mcu_reg_t tim4smen       : 1; /*!< 2 TIM4SMEN: TIM4 timer clock enable during Sleep and Stop modes */
        mcu_reg_t tim5smen       : 1; /*!< 3 TIM5SMEN: TIM5 timer clock enable during Sleep and Stop modes */
        mcu_reg_t tim6smen       : 1; /*!< 4 TIM6SMEN: TIM6 timer clock enable during Sleep and Stop modes */
        mcu_reg_t tim7smen       : 1; /*!< 5 TIM7SMEN: TIM7 timer clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved6_8    : 3; /*!< 8:6 Reserved, must be kept at reset value */
        mcu_reg_t lcdsmen        : 1; /*!< 9 LCDSMEN: LCD interface clock enable during Sleep and Stop modes */
        mcu_reg_t rtcapbsmen     : 1; /*!< 10 RTCAPBSMEN: RTC APB clock enable during Sleep and Stop modes */
        mcu_reg_t wwdgsmen       : 1; /*!< 11 WWDGSMEN: Window watchdog clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved12_13  : 2; /*!< 13:12 Reserved, must be kept at reset value */
        mcu_reg_t spi2smen       : 1; /*!< 14 SPI2SMEN: SPI 2 clock enable during Sleep and Stop modes */
        mcu_reg_t spi3smen       : 1; /*!< 15 SPI3SMEN: SPI 3 clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved16     : 1; /*!< 16 Reserved, must be kept at reset value */
        mcu_reg_t usart2smen     : 1; /*!< 17 USART2SMEN: USART 2 clock enable during Sleep and Stop modes */
        mcu_reg_t usart3smen     : 1; /*!< 18 USART3SMEN: USART 3 clock enable during Sleep and Stop modes */
        mcu_reg_t usart4smen     : 1; /*!< 19 USART4SMEN: USART 4 clock enable during Sleep and Stop modes */
        mcu_reg_t usart5smen     : 1; /*!< 20 USART5SMEN: USART 5 clock enable during Sleep and Stop modes */
        mcu_reg_t i2c1smen       : 1; /*!< 21 I2C1SMEN: I2C 1 clock enable during Sleep and Stop modes */
        mcu_reg_t i2c2smen       : 1; /*!< 22 I2C2SMEN: I2C 2 clock enable during Sleep and Stop modes */
        mcu_reg_t i2c3smen       : 1; /*!< 23 I2C3SMEN: I2C 3 clock enable during Sleep and Stop modes */
        mcu_reg_t crssmen        : 1; /*!< 24 CRSSMEN: CRS clock enable during Sleep and Stop modes */
        mcu_reg_t can1smen       : 1; /*!< 25 CAN1SMEN: CAN1 clock enable during Sleep and Stop modes */
        mcu_reg_t can2smen       : 1; /*!< 26 CAN2SMEN: CAN2 clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved27     : 1; /*!< 27 Reserved, must be kept at reset value */
        mcu_reg_t pwrsmen        : 1; /*!< 28 PWRSMEN: Power interface clock enable during Sleep and Stop modes */
        mcu_reg_t dac1smen       : 1; /*!< 29 DAC1SMEN: DAC1 interface clock enable during Sleep and Stop modes */
        mcu_reg_t opampsmen      : 1; /*!< 30 OPAMPSMEN: OPAMP interface clock enable during Sleep and Stop modes */
        mcu_reg_t lptim1smen     : 1; /*!< 31 LPTIM1SMEN: Low Power Timer 1 clock enable during Sleep and Stop modes */
    }
);

/**
 * @brief APB1 peripheral clock enable in Sleep and Stop modes register 2 (RCC_APB1SMENR2)
 *
 *        Address offset: 0x7C
 *        Reset value: 0x0000 0025
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_apb1smen2_t,
    {
        mcu_reg_t lpuart1smen    : 1; /*!< 0 LPUART1SMEN: Low-power UART 1 clock enable during Sleep and Stop modes */
        mcu_reg_t i2c4smen       : 1; /*!< 1 I2C4SMEN: I2C 4 clock enable during Sleep and Stop modes */
        mcu_reg_t swpmi1smen     : 1; /*!< 2 SWPMI1SMEN: Single wire protocol clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved3_4    : 2; /*!< 4:3 Reserved, must be kept at reset value */
        mcu_reg_t lptim2smen     : 1; /*!< 5 LPTIM2SMEN: Low Power Timer 2 clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved6_31   : 26; /*!< 31:6 Reserved, must be kept at reset value */
    }
);

/**
 * @brief APB2 peripheral clock enable in Sleep and Stop modes register (RCC_APB2SMENR)
 *
 *        Address offset: 0x80
 *        Reset value: 0x0167 7C01
 *        Access: no wait state, word, half-word and byte access.
 */
MCU_REG_TYPE (
    rcc_apb2smen_t,
    {
        mcu_reg_t syscfgsmen     : 1; /*!< 0 SYSCFGSMEN: SYSCFG + COMP + VREFBUF clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved1_9    : 9; /*!< 9:1 Reserved, must be kept at reset value */
        mcu_reg_t sdmmc1smen     : 1; /*!< 10 SDMMC1SMEN: SDMMC clock enable during Sleep and Stop modes */
        mcu_reg_t tim1smen       : 1; /*!< 11 TIM1SMEN: TIM1 timer clock enable during Sleep and Stop modes */
        mcu_reg_t spi1smen       : 1; /*!< 12 SPI1SMEN: SPI 1 clock enable during Sleep and Stop modes */
        mcu_reg_t tim8smen       : 1; /*!< 13 TIM8SMEN: TIM8 timer clock enable during Sleep and Stop modes */
        mcu_reg_t usart1smen     : 1; /*!< 14 USART1SMEN: USART 1 clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved15     : 1; /*!< 15 Reserved, must be kept at reset value */
        mcu_reg_t tim15smen      : 1; /*!< 16 TIM15SMEN: TIM15 timer clock enable during Sleep and Stop modes */
        mcu_reg_t tim16smen      : 1; /*!< 17 TIM16SMEN: TIM16 timer clock enable during Sleep and Stop modes */
        mcu_reg_t tim17smen      : 1; /*!< 18 TIM17SMEN: TIM17 timer clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved19_20  : 2; /*!< 20:19 Reserved, must be kept at reset value */
        mcu_reg_t sai1smen       : 1; /*!< 21 SAI1SMEN: Serial audio interface 1 (SAI1) clock enable during Sleep and Stop modes */
        mcu_reg_t sai2smen       : 1; /*!< 22 SAI2SMEN: Serial audio interface 2 (SAI2) clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved23     : 1; /*!< 23 Reserved, must be kept at reset value */
        mcu_reg_t dfsdm1smen     : 1; /*!< 24 DFSDM1SMEN: Digital filters for sigma-delta modulators (DFSDM1) clock enable during Sleep and Stop modes */
        mcu_reg_t Reserved25_31  : 7; /*!< 31:25 Reserved, must be kept at reset value */
    }
);

/**
 * @brief Peripherals independent clock configuration register (RCC_CCIPR)
 *
 *        Address offset: 0x88
 *        Reset value: 0x0000 0000
 *        Access: 0 ≤ wait state ≤ 2, word, half-word and byte access
 */
MCU_REG_TYPE (
    rcc_ccip_t,
    {
        mcu_reg_t usart1sel      : 2; /*!< 1:0 USART1SEL[1:0] USART1 clock source selection */
        mcu_reg_t usart2sel      : 2; /*!< 3:2 USART2SEL[1:0] USART2 clock source selection */
        mcu_reg_t usart3sel      : 2; /*!< 5:4 USART3SEL[1:0] USART3 clock source selection */
        mcu_reg_t usart4sel      : 2; /*!< 7:6 USART4SEL[1:0] USART4 clock source selection */
        mcu_reg_t usart5sel      : 2; /*!< 9:8 USART5SEL[1:0] USART5 clock source selection */
        mcu_reg_t lpuart1sel     : 2; /*!< 11:10 LPUART1SEL[1:0] LPUART1 clock source selection */
        mcu_reg_t i2c1sel        : 2; /*!< 13:12 I2C1SEL[1:0] I2C1 clock source selection */
        mcu_reg_t i2c2sel        : 2; /*!< 15:14 I2C2SEL[1:0] I2C2 clock source selection */
        mcu_reg_t i2c3sel        : 2; /*!< 17:16 I2C3SEL[1:0] I2C3 clock source selection */
        mcu_reg_t lptim1sel      : 2; /*!< 19:18 LPTIM1SEL[1:0] Low power timer 1 clock source selection */
        mcu_reg_t lptim2sel      : 2; /*!< 21:20 LPTIM2SEL[1:0] Low power timer 2 clock source selection */
        mcu_reg_t sai1sel        : 2; /*!< 23:22 SAI1SEL[1:0] SAI1 clock source selection */
        mcu_reg_t sai2sel        : 2; /*!< 25:24 SAI2SEL[1:0] SAI2 clock source selection */
        mcu_reg_t clk48sel       : 2; /*!< 27:26 CLK48SEL[1:0] 48 MHz clock source selection */
        mcu_reg_t adcsel         : 2; /*!< 29:28 ADCSEL[1:0] ADCs clock source selection */
        mcu_reg_t swpmi1sel      : 1; /*!< 30 SWPMI1SEL: SWPMI1 clock source selection */
        mcu_reg_t dfsdm1sel      : 1; /*!< 31 DFSDM1SEL: DFSDM1 clock source selection */
    }
);

/**
 * @brief Backup domain control register (RCC_BDCR)
 *
 *        Address offset: 0x90
 *        Reset value: 0x0000 0000, reset by Backup domain Reset, except LSCOSEL, LSCOEN
 *          and BDRST which are reset only by Backup domain power-on reset.

