heavyC1oud/smilebrd/SW/src/Core/MCU/stm32l475_rcc_reg.h
 *        Access: 0 ≤ wait state ≤ 3, word, half-word and byte access Wait states are inserted in case of
 *        successive accesses to this register.
 *
 *        The bits of the Backup domain control register (RCC_BDCR) are outside of the VCORE
 *        domain. As a result, after Reset, these bits are write-protected and the DBP bit in the
 *        Section 5.4.1: Power control register 1 (PWR_CR1) has to be set before these can be
 *        modified. Refer to Section 5.1.5: Battery backup domain on page 156 for further
 *        information. These bits (except LSCOSEL, LSCOEN and BDRST) are only reset after a
 *        Backup domain Reset (see Section 6.1.3: Backup domain reset). Any internal or external
 *        Reset will not have any effect on these bits.
 */
MCU_REG_TYPE (
    rcc_bdcr_t,
    {
        mcu_reg_t lseon          : 1; /*!< 0 LSEON: LSE oscillator enable */
        mcu_reg_t lserdy         : 1; /*!< 1 LSERDY: LSE oscillator ready */
        mcu_reg_t lsebyp         : 1; /*!< 2 LSEBYP: LSE oscillator bypass */
        mcu_reg_t lsedrv         : 2; /*!< 4:3 LSEDRV[1:0]: LSE oscillator's drive capability */
        mcu_reg_t lsecsson       : 1; /*!< 5 LSECSSON: CSS on LSE enable */
        mcu_reg_t lsecssd        : 1; /*!< 6 LSECSSD: CSS on LSE failure Detection */
        mcu_reg_t Reserved7      : 1; /*!< 7 Reserved, must be kept at reset value */
        mcu_reg_t rtcsel         : 2; /*!< 9:8 rtcsel[1:0] RTC clock source selection */
        mcu_reg_t Reserved10_14  : 5; /*!< 14:10 Reserved, must be kept at reset value */
        mcu_reg_t rtcen          : 1; /*!< 15 RTCEN: RTC clock enable */
        mcu_reg_t bdrst          : 1; /*!< 16 BDRST: Backup domain software reset */
        mcu_reg_t Reserved17_23  : 7; /*!< 23:17 Reserved, must be kept at reset value */
        mcu_reg_t lscoen         : 1; /*!< 24 LSCOEN: Low speed clock output enable */
        mcu_reg_t lscosel        : 1; /*!< 25 LSCOSEL: Low speed clock output selection */
        mcu_reg_t Reserved26_31  : 6; /*!< 31:26 Reserved, must be kept at reset value */
    }
);

/**
 * @brief Control/status register (RCC_CSR)
 *
 *        Address offset: 0x94
 *        Reset value: 0x0C00 0600, reset by system reset, except reset flags by power reset only.
 *        Access: 0 ≤ wait state ≤ 3, word, half-word and byte access
 *        Wait states are inserted in case of successive accesses to this register.
 */
MCU_REG_TYPE (
    rcc_csr_t,
    {
        mcu_reg_t lsion          : 1; /*!< 0 LSION: LSI oscillator enable */
        mcu_reg_t lsirdy         : 1; /*!< 1 LSIRDY: LSI oscillator ready */
        mcu_reg_t Reserved2_7    : 6; /*!< 7:2 Reserved, must be kept at reset value */
        mcu_reg_t msisrange      : 4; /*!< 8:11 MSI[3:0] MSI range after Standby mode */
        mcu_reg_t Reserved12_22  : 11; /*!< 22:12 Reserved, must be kept at reset value */
        mcu_reg_t rmv            : 1; /*!< 23 RMVF: Remove reset flag */
        mcu_reg_t fwrst          : 1; /*!< 24 FWRSTF: Firewall reset flag */
        mcu_reg_t oblrst         : 1; /*!< 25 OBLRSTF: Option byte loader reset flag */
        mcu_reg_t pinrst         : 1; /*!< 26 PINRSTF: PIN reset flag */
        mcu_reg_t borrst         : 1; /*!< 27 BORRSTF: BOR reset flag */
        mcu_reg_t sftrst         : 1; /*!< 28 SFTRSTF: Software reset flag */
        mcu_reg_t iwdgrst        : 1; /*!< 29 IWDGRSTF: Independent watchdog reset flag */
        mcu_reg_t wwdgrst        : 1; /*!< 30 WWDGRSTF: Window watchdog reset flag */
        mcu_reg_t lpwrrst        : 1; /*!< 31 LPWRRSTF: Low-power reset flag */
    }
);

/**
 * @brief RCC register map
 */
typedef __packed struct
{
    volatile rcc_cr_t           CR;             /*!< 01 0x00 */
    volatile rcc_icsc_t         ICSC;           /*!< 02 0x04 */
    volatile rcc_cfg_t          CFG;            /*!< 03 0x08 */
    volatile rcc_pllcfg_t       PLLCFG;         /*!< 04 0x0C */
    volatile rcc_pllsai1cfg_t   PLLSAI1CFG;     /*!< 05 0x10 */
    volatile rcc_pllsai2cfg_t   PLLSAI2CFG;     /*!< 06 0x14 */
    volatile rcc_cie_t          CIE;            /*!< 07 0x18 */
    volatile rcc_cif_t          CIF;            /*!< 08 0x1C */
    volatile rcc_cic_t          CIC;            /*!< 09 0x20 */
    volatile mcu_reg_t          RESERVED0;      /*!< 10 0x24 */
    volatile rcc_ahb1rst_t      AHB1RST;        /*!< 11 0x28 */
    volatile rcc_ahb2rst_t      AHB2RST;        /*!< 12 0x2C */
    volatile rcc_ahb3rst_t      AHB3RST;        /*!< 13 0x30 */
    volatile mcu_reg_t          RESERVED1;      /*!< 14 0x34 */
    volatile rcc_apb1rst1_t     APB1RST1;       /*!< 15 0x38 */
    volatile rcc_apb1rst2_t     APB1RST2;       /*!< 16 0x3C */
    volatile rcc_apb2rst_t      APB2RST;        /*!< 17 0x40 */
    volatile mcu_reg_t          RESERVED2;      /*!< 18 0x44 */
    volatile rcc_ahb1en_t       AHB1EN;         /*!< 19 0x48 */
    volatile rcc_ahb2en_t       AHB2EN;         /*!< 20 0x4C */
    volatile rcc_ahb3en_t       AHB3EN;         /*!< 21 0x50 */
    volatile mcu_reg_t          RESERVED3;      /*!< 22 0x54 */
    volatile rcc_apb1en1_t      APB1EN1;        /*!< 23 0x58 */
    volatile rcc_apb1en2_t      APB1EN2;        /*!< 24 0x5C */
    volatile rcc_apb2en_t       APB2EN;         /*!< 25 0x60 */
    volatile mcu_reg_t          RESERVED4;      /*!< 26 0x64 */
    volatile rcc_ahb1smen_t     AHB1SMEN;       /*!< 27 0x68 */
    volatile rcc_ahb2smen_t     AHB2SMEN;       /*!< 28 0x6C */
    volatile rcc_ahb3smen_t     AHB3SMEN;       /*!< 29 0x70 */
    volatile mcu_reg_t          RESERVED5;      /*!< 30 0x74 */
    volatile rcc_apb1smen1_t    APB1SMEN1;      /*!< 31 0x78 */
    volatile rcc_apb1smen2_t    APB1SMEN2;      /*!< 32 0x7C */
    volatile rcc_apb2smen_t     APB2SMEN;       /*!< 33 0x80 */
    volatile mcu_reg_t          RESERVED6;      /*!< 34 0x84 */
    volatile rcc_ccip_t         CCIP;           /*!< 35 0x88 */
    volatile mcu_reg_t          RESERVED7;      /*!< 36 0x8C */
    volatile rcc_bdcr_t         BDCR;           /*!< 37 0x90 */
    volatile rcc_csr_t          CSR;            /*!< 38 0x94 */
} rcc_regs_t;

CHECK_REG_MAP(rcc_regs_t, 38);

#define RCC_REGS_ADDR (rcc_regs_t*)RCC_BASE

#endif  // STM32L475_RCC_REG_H
